Tarea 1 CFD/Simulaciones/Re_10/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


vertices
(
    // pre-block
    (-6   -10   0.5) // 0
    ( -5.5  -10   0.5) // 1
    ( -5.5  -10  -0.5) // 2 
    (-6   -10  -0.5) // 3
    
    (-6    10   0.5) // 4
    ( -5.5   10   0.5) // 5
    ( -5.5   10  -0.5) // 6
    (-6    10  -0.5) // 7

 
    // obstacle blocks
    (  5.5  -10  0.5) // 8
    (  5.5  -10 -0.5) // 9

    (-0.70710678 -0.70710678  0.5) // 10
    ( 0.70710678 -0.70710678  0.5) // 11
    ( 0.70710678 -0.70710678 -0.5) // 12
    (-0.70710678 -0.70710678 -0.5) // 13

    (-0.70710678  0.70710678  0.5) // 14
    (-0.70710678  0.70710678 -0.5) // 15

    ( 0.70710678  0.70710678  0.5) // 16
    ( 0.70710678  0.70710678 -0.5) // 17

    (  5.5   10  0.5) // 18
    (  5.5   10 -0.5) // 19

    // post-block
    (   93   -10  0.5) // 20
    (   93   -10 -0.5) // 21
    (   93    10  0.5) // 22
    (   93    10 -0.5) // 23

);

blocks
(
    // pre-block
    hex ( 0  1  2  3  4  5  6  7) ( 60 1 30) simpleGrading (1 1 1)

    // obstacle blocks
    hex ( 1  8  9  2 10 11 12 13) (30 1 30) simpleGrading (1 1 1) // bottom
    hex ( 1 10 13  2  5 14 15  6) (30 1 30) simpleGrading (1 1 1) // left
    hex (14 16 17 15  5 18 19  6) (30 1 30) simpleGrading (1 1 1) // top
    hex (11  8  9 12 16 18 19 17) (30 1 30) simpleGrading (1 1 1) // right

    // post-block
    hex ( 8 20 21  9 18 22 23 19) (186 1 30) simpleGrading (1 1 1)
);

edges
(
    arc 10 11 (0 -1  0.5)
    arc 12 13 (0 -1 -0.5)
    arc 14 10 (-1 0  0.5)
    arc 15 13 (-1 0 -0.5)
    arc 14 16 (0  1  0.5)
    arc 15 17 (0  1 -0.5)
    arc 16 11 (1  0  0.5)
    arc 17 12 (1  0 -0.5)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 0  4  7  3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (20 21 23 22)
        );
    }
    wall
    {
        type wall;
        faces
        (
            ( 4  5  6  7)
            ( 5 18 19  6)
            (18 22 23 19)

            ( 0  1  2  3)
            ( 1  8  9  2)
            ( 8 20 21  9)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (10 11 12 13)
            (11 16 17 12)
            (14 16 17 15)
            (10 14 15 13)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            ( 0  1  5  4)
            ( 1 10 14  5)
            (14 16 18  5)
            (11  8 18 16)
            ( 1  8 11 10)
            ( 8 20 22 18)

            ( 3  7  6  2)
            ( 2  6 15 13)
            (15  6 19 17)
            (12 17 19  9)
            ( 2 13 12  9)
            ( 9 19 23 21)
        );
    }
);

mergePatchPairs
(
);
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
